XgXGhostXgX/Testbed-Design-For-Cause-Effect-Chains-Over-Wireless-Network/Projekte/6 Chains/qca_LCD_server_With_Tracealyzer/board/pin_mux.c
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as LCD_VD(20) */
	    IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN6_IDX, port3_pin6_config); /* PORT3 PIN6 (coords: C9) is configured as LCD_VD(20) */
	  const uint32_t port3_pin7_config = (
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as LCD_VD(21) */
	    IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN7_IDX, port3_pin7_config); /* PORT3 PIN7 (coords: B8) is configured as LCD_VD(21) */
	  const uint32_t port3_pin8_config = (
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as LCD_VD(22) */
	    IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN8_IDX, port3_pin8_config); /* PORT3 PIN8 (coords: A7) is configured as LCD_VD(22) */
	  const uint32_t port3_pin9_config = (
	    IOCON_PIO_FUNC1 |                                        /* Pin is configured as LCD_VD(23) */
	    IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
	    IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
	    IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
	    IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
	    IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
	    IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
	  );
	  IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN9_IDX, port3_pin9_config); /* PORT3 PIN9 (coords: C7) is configured as LCD_VD(23) */


    IOCON->PIO[0][22] =
        ((IOCON->PIO[0][22] &
          /* Mask bits to zero which are setting */
          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_INVERT_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_SLEW_MASK | IOCON_PIO_OD_MASK)))

         /* Selects pin function.
          * : PORT022 (pin B12) is configured as USB0_VBUS. */
         | IOCON_PIO_FUNC(PIO022_FUNC_ALT7)

         /* Selects function mode (on-chip pull-up/pull-down resistor control).
          * : Inactive.
          * Inactive (no pull-down/pull-up resistor enabled). */
         | IOCON_PIO_MODE(PIO022_MODE_INACTIVE)

         /* Input polarity.
          * : Disabled.
          * Input function is not inverted. */
         | IOCON_PIO_INVERT(PIO022_INVERT_DISABLED)

         /* Select Analog/Digital mode.
          * : Digital mode. */
         | IOCON_PIO_DIGIMODE(PIO022_DIGIMODE_DIGITAL)

         /* Driver slew rate.
          * : Standard mode, output slew rate control is enabled.
          * More outputs can be switched simultaneously. */
         | IOCON_PIO_SLEW(PIO022_SLEW_STANDARD)

         /* Controls open-drain mode.
          * : Normal.
          * Normal push-pull output. */
         | IOCON_PIO_OD(PIO022_OD_NORMAL));


//    const uint32_t port0_pin29_config = (/* Pin is configured as FC0_RXD_SDA_MOSI */
//                                         IOCON_PIO_FUNC1 |
//                                         /* No addition pin function */
//                                         IOCON_PIO_MODE_INACT |
//                                         /* Input function is not inverted */
//                                         IOCON_PIO_INV_DI |
//                                         /* Enables digital function */
//                                         IOCON_PIO_DIGITAL_EN |
//                                         /* Input filter disabled */
//                                         IOCON_PIO_INPFILT_OFF |
//                                         /* Standard mode, output slew rate control is enabled */
//                                         IOCON_PIO_SLEW_STANDARD |
//                                         /* Open drain is disabled */
//                                         IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN29 (coords: B13) is configured as FC0_RXD_SDA_MOSI */
//    IOCON_PinMuxSet(IOCON, 0U, 29U, port0_pin29_config);
//
//    const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO */
//                                         IOCON_PIO_FUNC1 |
//                                         /* No addition pin function */
//                                         IOCON_PIO_MODE_INACT |
//                                         /* Input function is not inverted */
//                                         IOCON_PIO_INV_DI |
//                                         /* Enables digital function */
//                                         IOCON_PIO_DIGITAL_EN |
//                                         /* Input filter disabled */
//                                         IOCON_PIO_INPFILT_OFF |
//                                         /* Standard mode, output slew rate control is enabled */
//                                         IOCON_PIO_SLEW_STANDARD |
//                                         /* Open drain is disabled */
//                                         IOCON_PIO_OPENDRAIN_DI);
//    /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
//    IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);

